###  Part # 2
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  %0A        }%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.ansibleinstance[0] will be created%0A  + resource "aws_instance" "ansibleinstance" {%0A      + ami                                  = "ami-05f408238af346b4f"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "projectkey"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = [%0A          + "sg-0ec4cbd2e16f765a6",%0A        ]%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-02503b7e9030a050f"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-AnsibleVM-3"%0A          + "Owner" = "Group10"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-AnsibleVM-3"%0A          + "Owner" = "Group10"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = true%0A          + device_name           = (known after apply)%0A          + encrypted             = true%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.ansibleinstance[1] will be created%0A  + resource "aws_instance" "ansibleinstance" {%0A      + ami                                  = "ami-05f408238af346b4f"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "projectkey"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = [%0A          + "sg-0ec4cbd2e16f765a6",%0A        ]%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-0060587b2b853bb81"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-AnsibleVM-4"%0A          + "Owner" = "Group10"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-AnsibleVM-4"%0A          + "Owner" = "Group10"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = true%0A          + device_name           = (known after apply)%0A          + encrypted             = true%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.ansibleinstance[1] (deposed object fe1421a9) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_instance" "ansibleinstance" {%0A      - ami                                  = "ami-05f408238af346b4f" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0c45380fb1710734d" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1d" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0c45380fb1710734d" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "projectkey" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-0e43d987a2e7aff9c" -> null%0A      - private_dns                          = "ip-10-1-4-21.ec2.internal" -> null%0A      - private_ip                           = "10.1.4.21" -> null%0A      - public_ip                            = "44.202.251.70" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0060587b2b853bb81" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-AnsibleVM-4"%0A          - "Owner" = "Group10"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-AnsibleVM-4"%0A          - "Owner" = "Group10"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = true -> null%0A          - iops                  = 100 -> null%0A          - kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0ab6dfe1d2914893c" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.bastion[0] must be replaced%0A+/- resource "aws_instance" "bastion" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-03548c74861b14bc4" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1b" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      ~ id                                   = "i-03548c74861b14bc4" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      ~ primary_network_interface_id         = "eni-04d64134a4995bd20" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-2-5.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.2.5" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      ~ public_ip                            = "3.81.113.198" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0043e500cee2dacde",%0A        ]%0A        tags                                 = {%0A            "Name" = "prod-Bastion-1"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0043e500cee2dacde",%0A        ] -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)%0A          - tags                  = {} -> null%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-0cfebc85206ee66cf" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A            # (2 unchanged attributes hidden)%0A        }%0A    }%0A%0A  # aws_instance.privateinstance[0] will be created%0A  + resource "aws_instance" "privateinstance" {%0A      + ami                                  = "ami-05f408238af346b4f"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = false%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "projectkey"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = [%0A          + "sg-01db37fc898c7eb8a",%0A        ]%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-0c892027b6c39593e"%0A      + tags                                 = {%0A          + "Name" = "prod-PrivateVM-1"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "prod-PrivateVM-1"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = true%0A          + device_name           = (known after apply)%0A          + encrypted             = true%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.privateinstance[0] (deposed object 444746ac) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_instance" "privateinstance" {%0A      - ami                                  = "ami-05f408238af346b4f" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0dcb1e2d60e6d9691" -> null%0A      - associate_public_ip_address          = false -> null%0A      - availability_zone                    = "us-east-1a" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0dcb1e2d60e6d9691" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "projectkey" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-05c711f160ef8b886" -> null%0A      - private_dns                          = "ip-10-1-5-183.ec2.internal" -> null%0A      - private_ip                           = "10.1.5.183" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0c892027b6c39593e" -> null%0A      - tags                                 = {%0A          - "Name" = "prod-PrivateVM-1"%0A        } -> null%0A      - tags_all                             = {%0A          - "Name" = "prod-PrivateVM-1"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-01db37fc898c7eb8a",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = true -> null%0A          - iops                  = 100 -> null%0A          - kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0f2a0fd72f0c66c7c" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.privateinstance[1] must be replaced%0A+/- resource "aws_instance" "privateinstance" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0a8a3e491065699ea" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1b" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      ~ id                                   = "i-0a8a3e491065699ea" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      ~ primary_network_interface_id         = "eni-02dbcc431560851ec" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-6-242.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.6.242" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-01db37fc898c7eb8a",%0A        ]%0A        tags                                 = {%0A            "Name" = "prod-PrivateVM-2"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-01db37fc898c7eb8a",%0A        ] -> (known after apply)%0A        # (9 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)%0A          - tags                  = {} -> null%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-04946ed9ef802c385" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A            # (2 unchanged attributes hidden)%0A        }%0A    }%0A%0A  # aws_instance.tfinstance[0] will be created%0A  + resource "aws_instance" "tfinstance" {%0A      + ami                                  = "ami-05f408238af346b4f"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "projectkey"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = [%0A          + "sg-0ec4cbd2e16f765a6",%0A        ]%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-090e0a68433c6b3b1"%0A      + tags                                 = {%0A          + "Name" = "prod-TFVM-1"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "prod-TFVM-1"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = "1f7d5905591ac289eec3d058f221d674c5077417"%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = true%0A          + device_name           = (known after apply)%0A          + encrypted             = true%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.tfinstance[0] (deposed object 26c7fec9) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_instance" "tfinstance" {%0A      - ami                                  = "ami-05f408238af346b4f" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0ab3336b0b9ac4ec1" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1a" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0ab3336b0b9ac4ec1" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "projectkey" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-0591532ea5d058848" -> null%0A      - private_dns                          = "ip-10-1-1-176.ec2.internal" -> null%0A      - private_ip                           = "10.1.1.176" -> null%0A      - public_ip                            = "54.221.3.60" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-090e0a68433c6b3b1" -> null%0A      - tags                                 = {%0A          - "Name" = "prod-TFVM-1"%0A        } -> null%0A      - tags_all                             = {%0A          - "Name" = "prod-TFVM-1"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data                            = "1f7d5905591ac289eec3d058f221d674c5077417" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = true -> null%0A          - iops                  = 100 -> null%0A          - kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0cba570e80773bdf4" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0APlan: 6 to add, 0 to change, 5 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @dkhan0103, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*